;;;; 1. Да се провери дали А, В, и С могат да образуват триъгълник.

(defun is-triangle (a b c)
  (and (> (+ a b) c) 
       (> (+ a c) b) 
       (> (+ b c) a)))

;;;; 2. Да се дефинира функция-предикат (функция, която проверява дали е изпълнено дадено условие и връща Т или NIL), която проверява дали:
;;;; - X лежи в интервала [5, 15];
;;;; - Y лежи в обединението на интервалите (1, 7) и (17, 54);

(defun x-interval (x start end)
  (< start x end))

(defun y-interval (y start1 end1 start2 end2)
  (or (and (>= y start1)
           (<= y end1))
      (and (>= y start2)
	   (<= y end2))))

;;;; 3. Да се намери най-голямото от 3 числа

(defun max3 (a b c)
  (cond ((and (>= a b) (>= a c)) a)
	((and(>= b a) (>= b c)) b)
	((and (>= c a) (>= c b)) c)))
