// 24. Да се състави програма, която проверява дали всичките цифри на зададено цяло число са четни.

#include "stdafx.h"
using namespace std;
#include <iostream>
#include <stdlib.h>
#include <conio.h>
#include <math.h>

void main(){
	system("chcp 1251");

	int M; // Цяло число
	int N = 0; // Същото цяло число, но с цифри в обратен ред

	int digit; // Променлива за отделяне на цифрите от числото M
	int brDigits = 0; // Брой на цифрите в числото
	int a[30]; // Масив за цифрите на числото N (т.е цифрите на M в правилен ред)

	int i; // Брояч в цикъл

	cout << "Enter M: "; cin >> M;


	// Получаване на число с цифрите в обратен ред и броя на цифрите (за масива "a").
	while (M>0)
	{
		digit = M % 10;
		N = N * 10 + digit;
		M = M / 10;
		brDigits++;
	}

	// Цикъл за извличане на цифрите от новото число N като елементи на масива "a".
	for (i = 0; i < brDigits; i++)
	{
		a[i] = N % 10;
		N = N / 10;
	}


	// Цикъл за определяне дали цифрите са в нарастваща последователност.
	for (i = 0; i < brDigits && a[i] % 2 == 0; i++);

		if (i == brDigits)
		{
			cout << "Всички цифри са четни.";
		}
		else
		{
			cout << "Не всички цифри са четни...";
		}
	

	

	_getch();
}